app/controllers/sessions_controller.rb

  def showSession
    current_user = User.where(authentication_token: params[:token]).first
---
SELECT  "users".* FROM "users" WHERE "users"."authentication_token" = ? ORDER BY "users"."id" ASC LIMIT ?  [["authentication_token", "sE-J-9ZHpupk5xKcRRvw"], ["LIMIT", 1]]

  def createSession
    email = params[:email].downcase
    password = params[:password]

    # if connect
    #   ldap = Net::LDAP.new(
    #           host: 'bet-ldap',
    #           port: 389,
    #           auth: {
    #             method: :simple,
    #             dn: 'cn=' + email + ', ou=worldwide,dc=arqsoft,dc=bet,dc=com,dc=co',
    #             password: password
    #           }
    #         )
    #   if ldap.bind # autentication with ldap

        user = User.where(email: email).first
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "jhon@bet.com.co"], ["LIMIT", 1]]

  def destroySession
    current_user = User.where(authentication_token: params[:token]).first
  	current_user&.authentication_token = nil
  	if current_user
      current_user.save
---
SELECT  "users".* FROM "users" WHERE "users"."authentication_token" = ? ORDER BY "users"."id" ASC LIMIT ?  [["authentication_token", "f-Jky4XveZCGxiFkNLTr"], ["LIMIT", 1]]
UPDATE "users" SET "authentication_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["authentication_token", "7bb5b9B3Zqy2YB_sxdbm"], ["updated_at", "2018-05-07 03:53:11.696825"], ["id", 4]]